* EXTRVEH - extract VEHICLES (DBID 1 via UDB, file 12, DDM VEHICLES)
* into vehicles.csv + counts_veh.txt per FLAT_FILE_CONTRACT.md.
* Headless run: NO terminal WRITE statements (avoids the MORE prompt).
DEFINE DATA LOCAL
1 V VIEW OF VEHICLES
  2 REG-NUM
  2 PERSONNEL-ID
  2 MAKE
  2 MODEL
  2 COLOR
  2 YEAR
1 #ISN (N10)
1 #F (A) DYNAMIC
1 #LINE (A) DYNAMIC
1 #FIRST (L)
1 #Q (I4)
1 #C (I4)
1 #CNT-VEH (N8)
END-DEFINE
*
DEFINE WORK FILE 6 '/poc/data/vehicles.csv' TYPE 'ASCII'
DEFINE WORK FILE 7 '/poc/data/counts_veh.txt' TYPE 'ASCII'
*
COMPRESS 'isn,reg_num,personnel_id,make,model,color,year_built'
  INTO #LINE LEAVING NO SPACE
WRITE WORK FILE 6 VARIABLE #LINE
*
READ V BY ISN
  #ISN := *ISN
  RESET #LINE
  #FIRST := TRUE
  COMPRESS #ISN INTO #F LEAVING NO SPACE
  PERFORM APPEND-F
  COMPRESS REG-NUM INTO #F LEAVING NO SPACE
  PERFORM APPEND-F
  COMPRESS PERSONNEL-ID INTO #F LEAVING NO SPACE
  PERFORM APPEND-F
  COMPRESS MAKE INTO #F LEAVING NO SPACE
  PERFORM APPEND-F
  COMPRESS MODEL INTO #F LEAVING NO SPACE
  PERFORM APPEND-F
  COMPRESS COLOR INTO #F LEAVING NO SPACE
  PERFORM APPEND-F
  COMPRESS YEAR INTO #F LEAVING NO SPACE
  PERFORM APPEND-F
  WRITE WORK FILE 6 VARIABLE #LINE
  ADD 1 TO #CNT-VEH
END-READ
*
CLOSE WORK FILE 6
COMPRESS 'vehicles.csv:' #CNT-VEH INTO #LINE LEAVING NO SPACE
WRITE WORK FILE 7 VARIABLE #LINE
CLOSE WORK FILE 7
*
* ---- RFC 4180: quote #F if it contains comma or quote; append to #LINE
DEFINE SUBROUTINE APPEND-F
  RESET #Q #C
  EXAMINE #F FOR '"' GIVING NUMBER #Q
  IF #Q > 0 THEN
    EXAMINE #F FOR '"' REPLACE WITH '""'
  END-IF
  EXAMINE #F FOR ',' GIVING NUMBER #C
  IF #Q > 0 OR #C > 0 THEN
    COMPRESS '"' #F '"' INTO #F LEAVING NO SPACE
  END-IF
  IF #FIRST THEN
    #LINE := #F
    #FIRST := FALSE
  ELSE
    COMPRESS #LINE ',' #F INTO #LINE LEAVING NO SPACE
  END-IF
END-SUBROUTINE
*
END
