* EXTREMP - extract EMPLOYEES (DBID 1 via UDB, file 11, DDM EMPLOYEES)
* into the contract CSVs (FLAT_FILE_CONTRACT.md):
*   employees.csv, employees_address_lines.csv, employees_languages.csv,
*   employees_income.csv + counts_emp.txt ("<file>:<count>" lines).
* Headless run: NO terminal WRITE statements (avoids the MORE prompt).
DEFINE DATA LOCAL
1 V VIEW OF EMPLOYEES
  2 PERSONNEL-ID
  2 FIRST-NAME
  2 MIDDLE-NAME
  2 NAME
  2 MAR-STAT
  2 SEX
  2 BIRTH
  2 CITY
  2 POST-CODE
  2 COUNTRY
  2 DEPT
  2 JOB-TITLE
  2 C*ADDRESS-LINE
  2 ADDRESS-LINE (1:10)
  2 C*LANG
  2 LANG (1:10)
  2 C*INCOME
  2 CURR-CODE (1:10)
  2 SALARY (1:10)
1 #ISN (N10)
1 #I (I4)
1 #MAX (I4)
1 #F (A) DYNAMIC
1 #LINE (A) DYNAMIC
1 #FIRST (L)
1 #Q (I4)
1 #C (I4)
1 #BIRTH8 (A8)
1 #CNT-EMP (N8)
1 #CNT-ADR (N8)
1 #CNT-LNG (N8)
1 #CNT-INC (N8)
END-DEFINE
*
DEFINE WORK FILE 1 '/poc/data/employees.csv' TYPE 'ASCII'
DEFINE WORK FILE 2 '/poc/data/employees_address_lines.csv' TYPE 'ASCII'
DEFINE WORK FILE 3 '/poc/data/employees_languages.csv' TYPE 'ASCII'
DEFINE WORK FILE 4 '/poc/data/employees_income.csv' TYPE 'ASCII'
DEFINE WORK FILE 5 '/poc/data/counts_emp.txt' TYPE 'ASCII'
*
COMPRESS 'isn,personnel_id,first_name,middle_name,last_name,mar_stat,'
  'sex,birth_yyyymmdd,city,postal_code,country,dept,job_title'
  INTO #LINE LEAVING NO SPACE
WRITE WORK FILE 1 VARIABLE #LINE
WRITE WORK FILE 2 VARIABLE 'parent_key,occurrence_index,address_line'
WRITE WORK FILE 3 VARIABLE 'parent_key,occurrence_index,language_code'
COMPRESS 'parent_key,occurrence_index,currency_code,salary_amount'
  INTO #LINE LEAVING NO SPACE
WRITE WORK FILE 4 VARIABLE #LINE
*
READ V BY PERSONNEL-ID
  #ISN := *ISN
*
* ---- employees.csv row -------------------------------------------
  RESET #LINE
  #FIRST := TRUE
  COMPRESS #ISN INTO #F LEAVING NO SPACE
  PERFORM APPEND-F
  COMPRESS PERSONNEL-ID INTO #F LEAVING NO SPACE
  PERFORM APPEND-F
  COMPRESS FIRST-NAME INTO #F LEAVING NO SPACE
  PERFORM APPEND-F
  COMPRESS MIDDLE-NAME INTO #F LEAVING NO SPACE
  PERFORM APPEND-F
  COMPRESS NAME INTO #F LEAVING NO SPACE
  PERFORM APPEND-F
  COMPRESS MAR-STAT INTO #F LEAVING NO SPACE
  PERFORM APPEND-F
  COMPRESS SEX INTO #F LEAVING NO SPACE
  PERFORM APPEND-F
  MOVE EDITED BIRTH (EM=YYYYMMDD) TO #BIRTH8
  COMPRESS #BIRTH8 INTO #F LEAVING NO SPACE
  PERFORM APPEND-F
  COMPRESS CITY INTO #F LEAVING NO SPACE
  PERFORM APPEND-F
  COMPRESS POST-CODE INTO #F LEAVING NO SPACE
  PERFORM APPEND-F
  COMPRESS COUNTRY INTO #F LEAVING NO SPACE
  PERFORM APPEND-F
  COMPRESS DEPT INTO #F LEAVING NO SPACE
  PERFORM APPEND-F
  COMPRESS JOB-TITLE INTO #F LEAVING NO SPACE
  PERFORM APPEND-F
  WRITE WORK FILE 1 VARIABLE #LINE
  ADD 1 TO #CNT-EMP
*
* ---- employees_address_lines.csv (MU ADDRESS-LINE) ---------------
  #MAX := C*ADDRESS-LINE
  IF #MAX > 10 THEN
    #MAX := 10
  END-IF
  FOR #I = 1 TO #MAX
    RESET #LINE
    #FIRST := TRUE
    COMPRESS #ISN INTO #F LEAVING NO SPACE
    PERFORM APPEND-F
    COMPRESS #I INTO #F LEAVING NO SPACE
    PERFORM APPEND-F
    COMPRESS ADDRESS-LINE(#I) INTO #F LEAVING NO SPACE
    PERFORM APPEND-F
    WRITE WORK FILE 2 VARIABLE #LINE
    ADD 1 TO #CNT-ADR
  END-FOR
*
* ---- employees_languages.csv (MU LANG) ---------------------------
  #MAX := C*LANG
  IF #MAX > 10 THEN
    #MAX := 10
  END-IF
  FOR #I = 1 TO #MAX
    RESET #LINE
    #FIRST := TRUE
    COMPRESS #ISN INTO #F LEAVING NO SPACE
    PERFORM APPEND-F
    COMPRESS #I INTO #F LEAVING NO SPACE
    PERFORM APPEND-F
    COMPRESS LANG(#I) INTO #F LEAVING NO SPACE
    PERFORM APPEND-F
    WRITE WORK FILE 3 VARIABLE #LINE
    ADD 1 TO #CNT-LNG
  END-FOR
*
* ---- employees_income.csv (PE INCOME, first level only) ----------
  #MAX := C*INCOME
  IF #MAX > 10 THEN
    #MAX := 10
  END-IF
  FOR #I = 1 TO #MAX
    RESET #LINE
    #FIRST := TRUE
    COMPRESS #ISN INTO #F LEAVING NO SPACE
    PERFORM APPEND-F
    COMPRESS #I INTO #F LEAVING NO SPACE
    PERFORM APPEND-F
    COMPRESS CURR-CODE(#I) INTO #F LEAVING NO SPACE
    PERFORM APPEND-F
    COMPRESS SALARY(#I) INTO #F LEAVING NO SPACE
    PERFORM APPEND-F
    WRITE WORK FILE 4 VARIABLE #LINE
    ADD 1 TO #CNT-INC
  END-FOR
END-READ
*
CLOSE WORK FILE 1
CLOSE WORK FILE 2
CLOSE WORK FILE 3
CLOSE WORK FILE 4
*
COMPRESS 'employees.csv:' #CNT-EMP INTO #LINE LEAVING NO SPACE
WRITE WORK FILE 5 VARIABLE #LINE
COMPRESS 'employees_address_lines.csv:' #CNT-ADR INTO #LINE
  LEAVING NO SPACE
WRITE WORK FILE 5 VARIABLE #LINE
COMPRESS 'employees_languages.csv:' #CNT-LNG INTO #LINE LEAVING NO SPACE
WRITE WORK FILE 5 VARIABLE #LINE
COMPRESS 'employees_income.csv:' #CNT-INC INTO #LINE LEAVING NO SPACE
WRITE WORK FILE 5 VARIABLE #LINE
CLOSE WORK FILE 5
*
* ---- RFC 4180: quote #F if it contains comma or quote; append to #LINE
DEFINE SUBROUTINE APPEND-F
  RESET #Q #C
  EXAMINE #F FOR '"' GIVING NUMBER #Q
  IF #Q > 0 THEN
    EXAMINE #F FOR '"' REPLACE WITH '""'
  END-IF
  EXAMINE #F FOR ',' GIVING NUMBER #C
  IF #Q > 0 OR #C > 0 THEN
    COMPRESS '"' #F '"' INTO #F LEAVING NO SPACE
  END-IF
  IF #FIRST THEN
    #LINE := #F
    #FIRST := FALSE
  ELSE
    COMPRESS #LINE ',' #F INTO #LINE LEAVING NO SPACE
  END-IF
END-SUBROUTINE
*
END
